src/DataProcessors/Пятнашки/Пятнашки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Пятнашки</name>
  <tabularSections>
    <name>Фишки</name>
    <attributes>
      <name>Число</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/Пятнашки/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для инд=1 По 16 Цикл
		УстановитьОбработчикКнопок(инд);
	КонецЦикла;
	
	Для инд=1 По 16 Цикл
		Стр = Объект.Фишки.Добавить();
		Стр.Число = инд;
		Стр.Представление = ?(Стр.Число=16, "", Стр.Число);
	КонецЦикла;

	УстановитьЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура КнопкаНажатие(Элемент)
	
	НомерКнопки = Число(СтрЗаменить(Элемент.Имя, "Кнопка", ""));
	Дырка = Объект.Фишки.НайтиСтроки(Новый Структура("Число", 16))[0].НомерСтроки;
	
	Сдвиг = Дырка - НомерКнопки;
	
	//Если Сдвиг = 4 Или Сдвиг = -4 Тогда
	//	
	//	Объект.Фишки.Сдвинуть(Дырка-1, -(Сдвиг-?(Сдвиг>0,1,-1)));
	//	Объект.Фишки.Сдвинуть(НомерКнопки-1, Сдвиг);
	//	
	//ИначеЕсли Сдвиг = 1 и НомерКнопки%4<>0)
	//	Или (Сдвиг = -1 и Дырка%4<>0)
	//	Тогда
	//	
	//	Объект.Фишки.Сдвинуть(Дырка-1, -(Сдвиг-?(Сдвиг>0,1,-1)));
	//	Объект.Фишки.Сдвинуть(НомерКнопки-1, Сдвиг);
	//
	//КонецЕсли
	
	Если Сдвиг % 4 = 0 Тогда
		К = ?(Сдвиг>0,1,-1);
		итерация = 4;
		Пока итерация <= Сдвиг*К Цикл 
			Объект.Фишки.Сдвинуть(Дырка-1 - (итерация-4)*К, -3*К);
			Объект.Фишки.Сдвинуть(НомерКнопки-1 + (Сдвиг*К-итерация)*К, 4*К);
			итерация = итерация + 4;
		КонецЦикла;
		
	ИначеЕсли Цел((НомерКнопки-1)/4) = Цел((Дырка-1)/4) Тогда
		
		Объект.Фишки.Сдвинуть(Дырка-1, НомерКнопки-Дырка);
		
	КонецЕсли;
	
	УстановитьЗначения();
	ПроверитьПазл();
		
КонецПроцедуры

&НаСервере 
Процедура УстановитьОбработчикКнопок(НомерКнопки)
	Элементы["Кнопка"+НомерКнопки].УстановитьДействие("Нажатие", "КнопкаНажатие");
КонецПроцедуры

&НаКлиенте
Процедура Перемешать(Команда)
	Таймер = '00010101';
	
	ПеремешатьНаСервере();
	
	ВремяНачалаИгры = ТекущаяДата();
	ПодключитьОбработчикОжидания("ВремяИгры", 1, Ложь);
КонецПроцедуры

&НаСервере 
Процедура ПеремешатьНаСервере()

	ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	Для инд=1 По 15 Цикл
		Сдвиг = ГСЧ.СлучайноеЧисло(0, инд);
		Объект.Фишки.Сдвинуть(инд, -Сдвиг);
	КонецЦикла;
	
	ПроверитьЧетность();
	
	УстановитьЗначения();

КонецПроцедуры

&НаСервере 
Процедура УстановитьЗначения()
	
	Для каждого Стр Из Объект.Фишки Цикл
		Кнопка = Элементы["Кнопка"+Стр.НомерСтроки];
		
		Кнопка.ТекстНевыбраннойКартинки = Стр.Представление;
		Если Стр.Число = 16 Тогда
			Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
		Иначе 
			Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная, 4);
		КонецЕсли;
		Кнопка.Рамка = Рамка;
		
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте 
Процедура ПроверитьПазл()
	Для каждого Стр Из Объект.Фишки Цикл
		Если Стр.НомерСтроки <> Стр.Число Тогда
			Возврат
		КонецЕсли;
	КонецЦикла;
	
	ОтключитьОбработчикОжидания("ВремяИгры");
	
	ВремяОкончанияИгры = ТекущаяДата();
	Таймер = '00010101' + (ВремяОкончанияИгры - ВремяНачалаИгры);	
	
	ПоказатьПредупреждение(, "БИНГО!!!!!!");
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЧетность() //четность
	
	сч = 0;
	
	Для инд1=1 По 16 Цикл
		Если Объект.Фишки[инд1-1].Число = 16 Тогда
			НомерДырки = инд1;
			Продолжить;
		КонецЕсли;
		
		Для инд2=инд1+1 По 16 Цикл
			Если Объект.Фишки[инд1-1].Число > Объект.Фишки[инд2-1].Число Тогда
				сч = сч + 1;	
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла; 
	
	РЕЗУЛЬТАТ = сч + Цел((НомерДырки-1)/4)+1;
	
	Если РЕЗУЛЬТАТ % 2 = 1 Тогда
		Если НомерДырки > 14 Тогда
			Объект.Фишки.Сдвинуть(13, 2);
		Иначе 
			Объект.Фишки.Сдвинуть(14,1);
		КонецЕсли;
		
		//Возврат Истина;
	КонецЕсли;
	
	//Возврат Ложь;
	
КонецФункции

&НаКлиенте 
Процедура ВремяИгры()
	Таймер = '00010101' + (ТекущаяДата() - ВремяНачалаИгры);	
КонецПроцедуры
